2345vor/RA6M4-uart/src/hal_entry.c
/*
 * 程序清单：这是一个 串口 设备使用例程
 * 例程导出了 uart_sample 命令到控制终端
 * 命令调用格式：uart_sample uart2
 * 命令解释：命令第二个参数是要使用的串口设备名称，为空则使用默认的串口设备
 * 程序功能：通过串口输出字符串"hello RT-Thread!"，然后错位输出输入的字符
*/

#include <rtthread.h>
#include "hal_data.h"
#include <rtdevice.h>
#include <stdio.h>
#include <string.h>

#define LED3_PIN    BSP_IO_PORT_01_PIN_06

void hal_entry(void)
{
    rt_kprintf("\nHello RT-Thread!\n");

    while (1)
    {
        rt_thread_mdelay(10);
    }
}

#define SAMPLE_UART_NAME       "uart0"

/* 用于接收消息的信号量 */
static struct rt_semaphore rx_sem;
static rt_device_t serial;

/* 接收数据回调函数 */
static rt_err_t uart_input(rt_device_t dev, rt_size_t size)
{
    /* 串口接收到数据后产生中断，调用此回调函数，然后发送接收信号量 */
    rt_sem_release(&rx_sem);

    return RT_EOK;
}

/*uart0串口输出线程*/
void serial_thread_entry(void *parameter)
{

    char str1[50];
    char HeadByte[50] ="/*KAANSATQRO";
    while (1)
    {
        sprintf(str1, "%s,%d", HeadByte, rt_pin_read(LED3_PIN));
        sprintf(str1, "%s,%d", str1,rt_pin_read(LED3_PIN));
        sprintf(str1, "%s%s", str1,"*/ \r\n");

        rt_device_write(serial, 0, str1, (sizeof(str1) - 1));
        rt_thread_mdelay(200);
    }
}

/*控制命令线程*/
void control_thread_entry(void *parameter)
{
    char ch;
    while (1)
    {
        /* 从串口读取一个字节的数据，没有读取到则等待接收信号量 */
        while (rt_device_read(serial, -1, &ch, 1) != 1)
        {
            /* 阻塞等待接收信号量，等到信号量后再次读取数据 */
            rt_sem_take(&rx_sem, RT_WAITING_FOREVER);
        }
        /* 读取到的数据通过串口错位输出 */
        ch = ch + 0;
        if(ch=='1')
        {
            rt_pin_write(LED3_PIN, PIN_HIGH);
            rt_thread_mdelay(50);
            rt_kprintf("\n PIN_HIGH \n");
        }
        else if(ch=='0')
        {
            rt_pin_write(LED3_PIN, PIN_LOW);
            rt_thread_mdelay(50);
            rt_kprintf("\n PIN_LOW \n");
        }
        else {
            rt_kprintf("\n error \n");
        }
        rt_device_write(serial, 0, &ch, 1);
        rt_thread_mdelay(5);
    }
}

/*初始化和启动串口输出和控制线程*/
static int uart_sample(int argc, char *argv[])
{
    rt_err_t ret = RT_EOK;
    char uart_name[RT_NAME_MAX];
    char str[] = "hello RT-Thread!\r\n";
    rt_kprintf("Hello RT-Thread!\n");
    if (argc == 2)
    {
        rt_strncpy(uart_name, argv[1], RT_NAME_MAX);
    }
    else
    {
        rt_strncpy(uart_name, SAMPLE_UART_NAME, RT_NAME_MAX);
    }

    /* 查找系统中的串口设备 */
    serial = rt_device_find(uart_name);
    if (!serial)
    {
        rt_kprintf("find %s failed!\n", uart_name);
        return RT_ERROR;
    }

    /* 初始化信号量 */
    rt_sem_init(&rx_sem, "rx_sem", 0, RT_IPC_FLAG_FIFO);
    /* 以中断接收及轮询发送模式打开串口设备 */
    rt_device_open(serial, RT_DEVICE_FLAG_INT_RX);
    /* 设置接收回调函数 */
    rt_device_set_rx_indicate(serial, uart_input);
    /* 发送字符串 */
    rt_device_write(serial, 0, str, (sizeof(str) - 1));

    /* 创建 control_thread 线程 */
    rt_thread_t control_thread = rt_thread_create("control", control_thread_entry, RT_NULL, 1024, 30, 10);
    /* 创建成功则启动线程 */
    if (control_thread != RT_NULL)rt_thread_startup(control_thread);

    /* 创建 serial_thread 线程 */
    rt_thread_t serial_thread = rt_thread_create("serial", serial_thread_entry, RT_NULL, 1024, 25, 10);
    /* 创建成功则启动线程 */
    if (serial_thread != RT_NULL)
    {
        rt_thread_startup(serial_thread);
    }
    else
    {
        ret = RT_ERROR;
    }
    return ret;

}
/* 导出到 msh 命令列表中 */
MSH_CMD_EXPORT(uart_sample, uart device sample);
